/*Функция pow(x,n)

Напишите функцию pow(x,n), которая возводит x в степень n и 
возвращает результат. 
Создайте страницу, которая запрашивает x и n, а затем выводит 
результат pow(x,n). */

function pow(x,n){
    let res = x;

    for(let i = 1; i < n; i++){
        res *= x;
    }

    return res;
}

let x = prompt('Напишите число которое нужно возвести в степень.', '');
let n = prompt('Напишите степень в которую хотите возвести число.', '');

if(n < 1){
    alert (`Число ${n} не корректно для степени, используйте натуральное число.`);
}else{
    alert (pow(x,n));
}